vertical-pod-autoscaler/experiments/sn-pbr-throughput/19/user.log
Running 15m test @ http://10.106.5.63:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 28.811ms, rate sampling interval: 92ms
  Thread calibration: mean lat.: 23.816ms, rate sampling interval: 70ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   213.88ms  175.10ms 819.71ms   78.59%
    Req/Sec    14.56     13.51    57.00     57.90%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  166.91ms
 75.000%  294.91ms
 90.000%  445.70ms
 99.000%  819.71ms
 99.900%    1.17s 
 99.990%    1.41s 
 99.999%    1.52s 
100.000%    1.52s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.455     0.000000            1         1.00
      44.223     0.100000         2653         1.11
      68.479     0.200000         5312         1.25
      98.111     0.300000         7958         1.43
     130.367     0.400000        10611         1.67
     166.911     0.500000        13262         2.00
     186.879     0.550000        14599         2.22
     208.639     0.600000        15915         2.50
     234.367     0.650000        17244         2.86
     263.423     0.700000        18579         3.33
     294.911     0.750000        19897         4.00
     312.831     0.775000        20558         4.44
     333.567     0.800000        21221         5.00
     354.815     0.825000        21883         5.71
     380.415     0.850000        22544         6.67
     410.623     0.875000        23207         8.00
     427.263     0.887500        23540         8.89
     445.695     0.900000        23873        10.00
     465.663     0.912500        24205        11.43
     490.495     0.925000        24536        13.33
     518.655     0.937500        24865        16.00
     535.039     0.943750        25031        17.78
     555.519     0.950000        25199        20.00
     577.023     0.956250        25362        22.86
     601.599     0.962500        25530        26.67
     631.295     0.968750        25696        32.00
     650.751     0.971875        25779        35.56
     670.207     0.975000        25862        40.00
     690.687     0.978125        25944        45.71
     714.751     0.981250        26026        53.33
     746.495     0.984375        26108        64.00
     763.391     0.985938        26152        71.11
     779.775     0.987500        26191        80.00
     803.839     0.989062        26232        91.43
     826.879     0.990625        26274       106.67
     855.039     0.992188        26315       128.00
     872.959     0.992969        26337       142.22
     885.759     0.993750        26357       160.00
     909.311     0.994531        26378       182.86
     940.543     0.995313        26398       213.33
     971.775     0.996094        26419       256.00
     989.695     0.996484        26429       284.44
    1010.175     0.996875        26440       320.00
    1032.703     0.997266        26450       365.71
    1049.599     0.997656        26460       426.67
    1088.511     0.998047        26471       512.00
    1101.823     0.998242        26476       568.89
    1112.063     0.998437        26481       640.00
    1130.495     0.998633        26486       731.43
    1162.239     0.998828        26493       853.33
    1185.791     0.999023        26497      1024.00
    1206.271     0.999121        26499      1137.78
    1229.823     0.999219        26502      1280.00
    1238.015     0.999316        26504      1462.86
    1249.279     0.999414        26507      1706.67
    1313.791     0.999512        26510      2048.00
    1317.887     0.999561        26511      2275.56
    1323.007     0.999609        26512      2560.00
    1329.151     0.999658        26513      2925.71
    1374.207     0.999707        26515      3413.33
    1389.567     0.999756        26516      4096.00
    1390.591     0.999780        26517      4551.11
    1390.591     0.999805        26517      5120.00
    1396.735     0.999829        26518      5851.43
    1406.975     0.999854        26519      6826.67
    1406.975     0.999878        26519      8192.00
    1443.839     0.999890        26520      9102.22
    1443.839     0.999902        26520     10240.00
    1443.839     0.999915        26520     11702.86
    1485.823     0.999927        26521     13653.33
    1485.823     0.999939        26521     16384.00
    1485.823     0.999945        26521     18204.44
    1485.823     0.999951        26521     20480.00
    1485.823     0.999957        26521     23405.71
    1519.615     0.999963        26522     27306.67
    1519.615     1.000000        26522          inf
#[Mean    =      213.877, StdDeviation   =      175.097]
#[Max     =     1518.592, Total count    =        26522]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  26849 requests in 15.00m, 350.07MB read
  Socket errors: connect 0, read 0, write 6, timeout 0
Requests/sec:     29.83
Transfer/sec:    398.28KB